app/controllers/books_controller.rb

    def create
        book = Book.where(:author => book_params[:author], :title => book_params[:title]).first_or_create! do |book|
            book.image_url = book_params[:image_url]
            book.synopsis = book_params[:synopsis]
            book.genre = book_params[:genre]
            end
        if book
            @current_user.bookshelves.where(:book_id => book.id).first_or_create! do |shelf|
---
INSERT INTO "books" ("image_url", "author", "title", "synopsis", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "books".* FROM "books" WHERE "books"."author" = $1 AND "books"."title" = $2 ORDER BY "books"."id" ASC LIMIT $3  [["author", "James Clear"], ["title", "Atomic Habits"], ["LIMIT", 1]]
INSERT INTO "bookshelves" ("user_id", "book_id", "read", "owned", "ownership_source", "preferred_cover_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "bookshelves".* FROM "bookshelves" WHERE "bookshelves"."user_id" = $1 AND "bookshelves"."book_id" = $2 ORDER BY "bookshelves"."id" ASC LIMIT $3  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]