app/controllers/ratings_controller.rb

    def index
        ratings = Rating.all
---
SELECT "ratings".* FROM "ratings"

    def my_ratings
        ratings = @current_user.ratings.all
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = $1  [["user_id", 3]]

    def create
        ratingexists = @current_user.ratings.find_by(book_id: params[:book_id])
        if ratingexists
            render json: RatingSerializer.new(ratingexists)
        elsif
            rating = @current_user.ratings.create!(rating_params)
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = $1 AND "ratings"."book_id" = $2 LIMIT $3  [["user_id", 4], ["book_id", 4], ["LIMIT", 1]]
INSERT INTO "ratings" ("user_id", "book_id", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["book_id", 4], ["rating", 4], ["created_at", "2022-10-14 09:15:16.842545"], ["updated_at", "2022-10-14 09:15:16.842545"]]

    def update
        rating = @current_user.ratings.find_by(id: params[:id])
        # if rating
            rating.update!(rating_params)
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = $1 AND "ratings"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]
UPDATE "ratings" SET "rating" = $1, "updated_at" = $2 WHERE "ratings"."id" = $3  [["rating", 5], ["updated_at", "2022-10-14 09:51:25.734096"], ["id", 1]]

    def destroy
        rating = Rating.find_by(id: params[:id])
        rating.destroy
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = $1  [["id", 1]]