app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test234"], ["email", "test234@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-10-14 07:52:59.880476"], ["updated_at", "2022-10-14 07:52:59.880476"]]